<template>
    <section class="projects">
      <!-- <h2>Ответы</h2> -->
      <div class="project transform transition hover:scale-105 hover:shadow-xl" v-for="project in projects" :key="project.title">
        <div class="project-header">
          <span><h3 class="text-2xl font-semibold text-black">
            {{ project.title }}</h3>
          </span>
        </div>
        <div class="project-body">
          <!-- <h3 class="text-2xl font-semibold text-black">{{ project.title }}</h3> -->
          <p>{{ project.description }}</p>
          <AppButton class="project transform transition hover:scale-105 hover:shadow-xl">Комментировать</AppButton>
        </div>
      </div>
    </section>
  </template>
  
  <script>
  export default {
    data() {
      return {
        projects: [
          { date: '2020-04-08', title: 'Как записаться на курс в автошколу?', description: 'Записаться можно через сайт автошколы, по телефону или лично в офисе.' },
          { date: '2020-04-09', title: 'Какова стоимость обучения в вашей автошколе?', description: 'Стоимость зависит от типа курса и может варьироваться.' },
          { date: '2020-04-08', title: 'Сколько длится курс для получения прав категории B?', description: 'Обычно от 1 до 3 месяцев, в зависимости от графика и интенсивности.' },
          { date: '2020-04-09', title: 'Какой минимальный возраст для начала обучения на права категории B?', description: '15,8 лет.' },
          { date: '2020-04-08', title: 'Есть ли возможность пройти обучение на иностранных языках?', description: 'Да, на английском.' },
          { date: '2020-04-09', title: 'Какие есть скидки и акции на обучение?', description: 'Скидки могут быть на пакетные предложения, раннюю запись, группы и т.д.' },
          { date: '2020-04-08', title: 'Как часто проходят занятия в автошколе?', description: 'Урок теории проходит один раз в неделю.' },
          { date: '2020-04-09', title: 'Сколько стоит повторная сдача экзамена?', description: 'Повторная сдача бесплатно.' },
          { date: '2020-04-08', title: 'Можно ли заниматься в автошколе в выходные дни?', description: 'Да, мы предлага занятия в выходные.' },
          { date: '2020-04-09', title: 'Есть ли возможность обучения на собственном автомобиле?', description: 'В нашей автошколе нет возможности проходит обучение на своем автомобиле' },
          { date: '2020-04-08', title: 'Как часто нужно обновлять медицинскую справку?', description: 'Обычно справка действительна в течение 10 лет.' },
          { date: '2020-04-09', title: 'Можно ли изменить курс после начала обучения?', description: 'Да, возможно изменение курса при согласовании с автошколой.' },
          { date: '2020-04-09', title: 'Сколько уроков вождения мне потребуется для успешной сдачи экзамена?', description: 'Количество уроков зависит от ваших навыков и прогресса, но минимум 28 уроков по вождению.' },
          { date: '2020-04-09', title: 'Есть ли возможность получения водительских прав за границей?', description: 'Возможно, но вам нужно будет узнать детали у местных властей.' },
          { date: '2020-04-09', title: 'Как часто нужно проходить обновление водительских прав?', description: 'Начальные права дают на 2 года и после постоянные на 10 лет.' },
          { date: '2020-04-09', title: 'Можно ли получить справку об окончании курсов до получения прав?', description: 'Да, автошкола может выдать такую справку по окончании курса' },
          { date: '2020-04-09', title: 'Какие виды оплаты доступны для обучения?', description: 'Оплата возможна наличными, картой, по счету или рассрочке.' },
          { date: '2020-04-09', title: 'Могу ли я получить обучение только по теории?', description: 'Да, многие автошколы предлагают только теоретические курсы.' },
          { date: '2020-04-09', title: 'Какие шаги нужно предпринять для начала обучения?', description: 'Запись на курс, предоставление необходимых документов и прохождение медицинского осмотра.' },
          { date: '2020-04-09', title: 'Как проводится экзамен по вождению?', description: 'Экзамен проводится на специальной площадке или в реальных дорожных условиях под наблюдением экзаменатора.' },
          { date: '2020-04-09', title: 'Как долго длится практическое занятие по вождению?', description: '45 минут' },
          { date: '2020-04-09', title: 'Можно ли оплатить обучение частями?', description: 'Да, мы предлагаем рассрочку' },
          { date: '2020-04-09', title: 'Как получить обратную связь после окончания курса?', description: 'Обратную связь можно получить через администрацию автошколы или инструкторов.' },
        ]
      };
    }
  };
  </script>
  
  <style scoped>
  .projects {
    background: #e1e1e1;
    padding: 20px;
    display: grid;
    grid-template-columns: repeat(2, 1fr); /* Два столбца */
    gap: 20px; /* Отступы между блоками */
  }
  .project {
    background: #fff;
    border: 2px solid #000;
    margin-bottom: 20px;
    padding: 20px;
    box-shadow: 5px 5px 0 #000;
  }
  .project-header {
    background: #3df7f7;
    padding: 10px;
  }



  .project-body h3 {
    margin: 0 0 10px;
  }
  .project-body p {
    margin: 0 0 10px;
  }
  .project-body button {
    padding: 10px 20px;
    background: #ff9500;
    color: #141313;
    border: none;
    cursor: pointer;
  }
  </style>
  